Revit 2027 API
PropertySetElementFailures Properties
The BuiltInFailures.PropertySetElementFailures type exposes the following members.
Properties
Name | Description
EmptyPropertySetName |  A property set name cannot be an empty string.
NonStringParameterValue |  The given parameter requires a string value.
NonUniquePropertySetName |  The value of the given parameter is already in use as a property set name.
Top
See Also
Reference
BuiltInFailures.PropertySetElementFailures Class
Autodesk.Revit.DB Namespace